{
    "version": "https://jsonfeed.org/version/1",
    "title": "Yuri Rossi Tonin Blog",
    "home_page_url": "https://yurirtonin.github.io/blog",
    "description": "Yuri Rossi Tonin Blog",
    "items": [
        {
            "id": "https://yurirtonin.github.io/blog/2022/11/17/when_monologue_gets_to_you",
            "content_html": "<p>I started watching Disney's \"Star Wars Andor\" a few days ago and, boy, what a (unexpected) great experience!</p>\n<p>In some sense, Andor compiles much of what makes me love movies and TV shows. A great script makes you curious about what the characters are planning next and makes you put yourself in their positions: \"Would I do the same as them right now?\". In special, science-fiction creates environments that we, plain 21st century human beings, will never be able to experience. These environments allow writers/directors/actors to explore human feelings in ways that would hardly be possible otherwise. And on top of that, Andor gives us amazing scenarios and CGI, which constantly reminds me how far technology has come to make us dream and wonder.</p>\n<p>But besides that, few things get to me as great dialogues (and, particularly, monologues) do. I can safely say that Andor has given me one of my favorite monologues of all time. Few have caused me to feel the way I did right there, when I first heard it. In the 10th episode, Luthen (interpreted by the impeccable Stellan Skarsgård), is confronted by another character. In a rather defying tone, he puts into question Luthen's contributtion to the Rebellion by asking:</p>\n<blockquote>\n<p>\"And what do you sacrifice!?\"</p>\n</blockquote>\n<p>To which a dark, introspective Skarsgård responds:</p>\n<blockquote>\n<p>\"Calm. Kindness. Kinship. Love...</p>\n<p>I’ve given up all chance at inner peace. I’ve made my mind a sunless space. I share my dreams with ghosts.</p>\n<p>I wake up every day to an equation I wrote 15 years ago for which there’s only one conclusion: I’m damned for what I do.</p>\n<p>My anger, my ego, my unwillingness to yield, my... my eagerness to fight, they’ve set me on a path from which there is no escape. I yearned to be a savior against injustice without contemplating the cost and, by the time I looked down, there was no longer any ground beneath my feet.</p>\n<p>What is my… what is my sacrifice?</p>\n<p>I’m condemned to use the tools of my enemy to defeat them. I burn my decency for someone else’s future. I burn my life to make a sunrise that I know I’ll never see. Now the ego that started this fight will never have a mirror or an audience or... or the light of gratitude.</p>\n<p>So what do I sacrifice?</p>\n<p>Everything!\"</p>\n</blockquote>\n<p>What a monologue, my friends, what a monologue...</p>\n<p>As long as the screens keep giving us pieces like this now and then, I am sure I will keep giving them my <del>money</del> love.</p>\n<p>Best,</p>\n<p>Y.</p>\n<hr>\n<div class=\"center\"><span class=\"italic\">The opinions expressed here are stricly my own. They do not represent the opinions or views of my current employer nor any of my previous ones.</span></div>\n<hr>",
            "url": "https://yurirtonin.github.io/blog/2022/11/17/when_monologue_gets_to_you",
            "title": "When a monologue gets to you",
            "summary": "description",
            "date_modified": "2022-11-17T00:00:00.000Z",
            "author": {
                "name": "Yuri R. Tonin",
                "url": "https://github.com/yurirt94"
            },
            "tags": [
                "andor",
                "star wars",
                "monologue",
                "skaasgård"
            ]
        },
        {
            "id": "https://yurirtonin.github.io/blog/2022/09/26/introduction",
            "content_html": "<p>Welcome!</p>\n<p>This is my personal corner. Herein, I intend to ocasionally post some thoughts and\nopinions. Perhaps even tell you about interesting places I've visited and experiences I've had.</p>\n<p>In essence, I hope to expose a little bit of my curiosity about our world and to let out some thoughts\nthat hunt my mind once in a while.</p>\n<p>I hope you like it!</p>\n<!-- -->\n<hr>\n<div class=\"center\"><span class=\"italic\">The opinions expressed here are stricly my own. They do not represent the opinions or views of my current employer nor any of my previous ones.</span></div>\n<hr>",
            "url": "https://yurirtonin.github.io/blog/2022/09/26/introduction",
            "title": "Welcome!",
            "summary": "description",
            "date_modified": "2022-09-26T00:00:00.000Z",
            "author": {
                "name": "Yuri R. Tonin",
                "url": "https://github.com/yurirt94"
            },
            "tags": [
                "welcome"
            ]
        }
    ]
}